{
    "profile": "I'm a Software Engineer having working experience in front end web development. Like to code,love to party, and open to learn new things and never ever say no to a problem even if I dont know the solution",
    "workExperience": [
        {
            "title": "1) FRONT END WEB DEVELOPER| Moonraft Innovation labs, Bangalore | Aug 2018 - May 2019",
            "description": "Worked as a front end web developer in a team, Works were maily related delivering  quality and responsive web application for the client"
        },
        {
            "title": "2) FULL STACK WEB DEVELOPER| Piktorlabs , Bangalore | june 2019 - Present",
            "description": "Worked as a full stack web developer in creating responsive and efficient web applications from both front end and backend."
        }
    ],
    "skills": [
        "Javascript / Have a working experience",
        "ReactJs / Have a working experience",
        "RectNative / Have a working experience",
        "NodeJs / Have a working experience",
        "Python / Basic knowledge",
        "Gatsby / Have a working experience",
        "PolymerJs / Have a working experience",
        "D3 / Have a working experience",
        "React-Redux and Redux-saga / Have a working experience",
        "GraphQl / Intermediate knowledge ",
        "bootstrap / Basic knowledge"
    ],
    "projectDetails": [
        {
            "title": "Information Security Dashboard (Hawkeye) | Aug 2018 - May 2019",
            "client": "T-Mobile (USA)",
            "projectDesc": "Project motive is to create effective visual dashboard for monitoring application's security information both in data and numerical wise in representational way",
            "roleDesc": "My role in this project was to develop and maintaining the UI/UX part of the web application.daily sync up with client team in order to achieve responsive and quality application for end user.Application was developed and delivered with all quality standards as per client requirement.",
            "techStack": "PolymerJS(javascript framework),D3,javascript,html-5,css-3"
        },
        {
            "title": "Cloud Center of Excellence | Apr 2019 - Jun 2019",
            "client": "T-Mobile (USA)",
            "ProjectDesc": "This project is mainly designed to handle the organisational events and actions.This  was a blogging application designed to showcase all the events of the respective organization in unified way ",
            "roleDesc": "my role in this project was to develop the complete application from scratch in both UI and backend side.Application was developed and delivered with all standard and measure as per client requirement.",
            "techStack": "ReactJs,Gatsby,graphQl,javascript,html-5,css-3"
        },
        {
            "title": "Cloud-IAM | Jul 2019 - Present",
            "client": "T-Mobile (USA)",
            "ProjectDesc": "Application deals with handling the aws role creation in sync with azure groups.Its an unique platform where user can create customized aws roles as per his requirement in the project",
            "roleDesc": "Working as UI lead developer  Responsible for bug-free and quality user interface development as per client standards. Adding creative ideas to the user interface in sync with client measure and delivering efficient  application in time for end user. Complete handling and maintenance of UI/UX part of application is the key achievement in this project.",
            "techStack": "ReactJs(with react-hooks),Redux,redux-saga,html-5,css-3"
        },
        {
            "title": "AddOn | Jun 2019 - Present",
            "client": "Internal Product",
            "ProjectDesc": "This is the mobile application used for day-to-day tracking of numerical list of user in modern and precise way",
            "roleDesc": "My role in this project is to develop the application by adding creative ideas to the application, hence improving user experience and scalability of the product.",
            "techStack": "ReactNative,Redux,firebase,nodeJs"
        }
    ],
    "internalProjects": [
        {
            "title": "Real-Time weather App",
            "imgUrl": "facebook.svg"
        },
        {
            "title": "Task manager API's",
            "imgUrl": "facebook.svg"
        }
    ],
    "education": [
        "Graducated as Mechanical Engineer from Bangalore Institute of Technology with 71.1% "
    ],
    "Interests": [
        "Interested in watching fictional TV shows, movies.",
        "I love to catch up with friends more offten and explore adventure activities.",
        "Crazy about cars want to do auto Blogging"
    ]
}